HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPms_bf.h
/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.SDVOK */
#define IFX_PMS_EVRSTAT_SDVOK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.SDVOK */
#define IFX_PMS_EVRSTAT_SDVOK_OFF (21u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.EVRCMOD */
#define IFX_PMS_EVRSTAT_EVRCMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.EVRCMOD */
#define IFX_PMS_EVRSTAT_EVRCMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.EVRCMOD */
#define IFX_PMS_EVRSTAT_EVRCMOD_OFF (22u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.OVPRE */
#define IFX_PMS_EVRSTAT_OVPRE_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.OVPRE */
#define IFX_PMS_EVRSTAT_OVPRE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.OVPRE */
#define IFX_PMS_EVRSTAT_OVPRE_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.OVSB */
#define IFX_PMS_EVRSTAT_OVSB_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.OVSB */
#define IFX_PMS_EVRSTAT_OVSB_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.OVSB */
#define IFX_PMS_EVRSTAT_OVSB_OFF (25u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.OVDDM */
#define IFX_PMS_EVRSTAT_OVDDM_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.OVDDM */
#define IFX_PMS_EVRSTAT_OVDDM_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.OVDDM */
#define IFX_PMS_EVRSTAT_OVDDM_OFF (26u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.UVPRE */
#define IFX_PMS_EVRSTAT_UVPRE_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.UVPRE */
#define IFX_PMS_EVRSTAT_UVPRE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.UVPRE */
#define IFX_PMS_EVRSTAT_UVPRE_OFF (27u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.UVSB */
#define IFX_PMS_EVRSTAT_UVSB_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.UVSB */
#define IFX_PMS_EVRSTAT_UVSB_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.UVSB */
#define IFX_PMS_EVRSTAT_UVSB_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.UVDDM */
#define IFX_PMS_EVRSTAT_UVDDM_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.UVDDM */
#define IFX_PMS_EVRSTAT_UVDDM_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.UVDDM */
#define IFX_PMS_EVRSTAT_UVDDM_OFF (29u)

/** \brief Length for Ifx_PMS_EVRADCSTAT_Bits.ADCCV */
#define IFX_PMS_EVRADCSTAT_ADCCV_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRADCSTAT_Bits.ADCCV */
#define IFX_PMS_EVRADCSTAT_ADCCV_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRADCSTAT_Bits.ADCCV */
#define IFX_PMS_EVRADCSTAT_ADCCV_OFF (0u)

/** \brief Length for Ifx_PMS_EVRADCSTAT_Bits.ADC33V */
#define IFX_PMS_EVRADCSTAT_ADC33V_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRADCSTAT_Bits.ADC33V */
#define IFX_PMS_EVRADCSTAT_ADC33V_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRADCSTAT_Bits.ADC33V */
#define IFX_PMS_EVRADCSTAT_ADC33V_OFF (8u)

/** \brief Length for Ifx_PMS_EVRADCSTAT_Bits.ADCSWDV */
#define IFX_PMS_EVRADCSTAT_ADCSWDV_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRADCSTAT_Bits.ADCSWDV */
#define IFX_PMS_EVRADCSTAT_ADCSWDV_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRADCSTAT_Bits.ADCSWDV */
#define IFX_PMS_EVRADCSTAT_ADCSWDV_OFF (16u)

/** \brief Length for Ifx_PMS_EVRADCSTAT_Bits.OVC */
#define IFX_PMS_EVRADCSTAT_OVC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRADCSTAT_Bits.OVC */
#define IFX_PMS_EVRADCSTAT_OVC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRADCSTAT_Bits.OVC */
#define IFX_PMS_EVRADCSTAT_OVC_OFF (24u)

/** \brief Length for Ifx_PMS_EVRADCSTAT_Bits.OV33 */
#define IFX_PMS_EVRADCSTAT_OV33_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRADCSTAT_Bits.OV33 */
#define IFX_PMS_EVRADCSTAT_OV33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRADCSTAT_Bits.OV33 */
#define IFX_PMS_EVRADCSTAT_OV33_OFF (25u)

/** \brief Length for Ifx_PMS_EVRADCSTAT_Bits.OVSWD */
#define IFX_PMS_EVRADCSTAT_OVSWD_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRADCSTAT_Bits.OVSWD */
#define IFX_PMS_EVRADCSTAT_OVSWD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRADCSTAT_Bits.OVSWD */
#define IFX_PMS_EVRADCSTAT_OVSWD_OFF (26u)

/** \brief Length for Ifx_PMS_EVRADCSTAT_Bits.UVC */
#define IFX_PMS_EVRADCSTAT_UVC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRADCSTAT_Bits.UVC */
#define IFX_PMS_EVRADCSTAT_UVC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRADCSTAT_Bits.UVC */
#define IFX_PMS_EVRADCSTAT_UVC_OFF (27u)

/** \brief Length for Ifx_PMS_EVRADCSTAT_Bits.UV33 */
#define IFX_PMS_EVRADCSTAT_UV33_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRADCSTAT_Bits.UV33 */
#define IFX_PMS_EVRADCSTAT_UV33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRADCSTAT_Bits.UV33 */
#define IFX_PMS_EVRADCSTAT_UV33_OFF (28u)

/** \brief Length for Ifx_PMS_EVRADCSTAT_Bits.UVSWD */
#define IFX_PMS_EVRADCSTAT_UVSWD_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRADCSTAT_Bits.UVSWD */
#define IFX_PMS_EVRADCSTAT_UVSWD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRADCSTAT_Bits.UVSWD */
#define IFX_PMS_EVRADCSTAT_UVSWD_OFF (29u)

/** \brief Length for Ifx_PMS_EVRRSTCON_Bits.RSTCTRIM */
#define IFX_PMS_EVRRSTCON_RSTCTRIM_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRRSTCON_Bits.RSTCTRIM */
#define IFX_PMS_EVRRSTCON_RSTCTRIM_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRRSTCON_Bits.RSTCTRIM */
#define IFX_PMS_EVRRSTCON_RSTCTRIM_OFF (0u)

/** \brief Length for Ifx_PMS_EVRRSTCON_Bits.RST33TRIM */
#define IFX_PMS_EVRRSTCON_RST33TRIM_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRRSTCON_Bits.RST33TRIM */
#define IFX_PMS_EVRRSTCON_RST33TRIM_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRRSTCON_Bits.RST33TRIM */
#define IFX_PMS_EVRRSTCON_RST33TRIM_OFF (8u)

/** \brief Length for Ifx_PMS_EVRRSTCON_Bits.RSTSWDTRIM */
#define IFX_PMS_EVRRSTCON_RSTSWDTRIM_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRRSTCON_Bits.RSTSWDTRIM */
#define IFX_PMS_EVRRSTCON_RSTSWDTRIM_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRRSTCON_Bits.RSTSWDTRIM */
#define IFX_PMS_EVRRSTCON_RSTSWDTRIM_OFF (16u)

/** \brief Length for Ifx_PMS_EVRRSTCON_Bits.RSTCOFF */
#define IFX_PMS_EVRRSTCON_RSTCOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRRSTCON_Bits.RSTCOFF */
#define IFX_PMS_EVRRSTCON_RSTCOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRRSTCON_Bits.RSTCOFF */
#define IFX_PMS_EVRRSTCON_RSTCOFF_OFF (24u)

