HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPms_bf.h
/** \brief Mask for Ifx_PMS_EVRTRIMSTAT_Bits.SDVOUTTRIM */
#define IFX_PMS_EVRTRIMSTAT_SDVOUTTRIM_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVRTRIMSTAT_Bits.SDVOUTTRIM */
#define IFX_PMS_EVRTRIMSTAT_SDVOUTTRIM_OFF (24u)

/** \brief Length for Ifx_PMS_MONSTAT1_Bits.ADCCV */
#define IFX_PMS_MONSTAT1_ADCCV_LEN (8u)

/** \brief Mask for Ifx_PMS_MONSTAT1_Bits.ADCCV */
#define IFX_PMS_MONSTAT1_ADCCV_MSK (0xffu)

/** \brief Offset for Ifx_PMS_MONSTAT1_Bits.ADCCV */
#define IFX_PMS_MONSTAT1_ADCCV_OFF (0u)

/** \brief Length for Ifx_PMS_MONSTAT1_Bits.ADC33V */
#define IFX_PMS_MONSTAT1_ADC33V_LEN (8u)

/** \brief Mask for Ifx_PMS_MONSTAT1_Bits.ADC33V */
#define IFX_PMS_MONSTAT1_ADC33V_MSK (0xffu)

/** \brief Offset for Ifx_PMS_MONSTAT1_Bits.ADC33V */
#define IFX_PMS_MONSTAT1_ADC33V_OFF (8u)

/** \brief Length for Ifx_PMS_MONSTAT1_Bits.ADCSWDV */
#define IFX_PMS_MONSTAT1_ADCSWDV_LEN (8u)

/** \brief Mask for Ifx_PMS_MONSTAT1_Bits.ADCSWDV */
#define IFX_PMS_MONSTAT1_ADCSWDV_MSK (0xffu)

/** \brief Offset for Ifx_PMS_MONSTAT1_Bits.ADCSWDV */
#define IFX_PMS_MONSTAT1_ADCSWDV_OFF (16u)

/** \brief Length for Ifx_PMS_MONSTAT1_Bits.ACTVCNT */
#define IFX_PMS_MONSTAT1_ACTVCNT_LEN (6u)

/** \brief Mask for Ifx_PMS_MONSTAT1_Bits.ACTVCNT */
#define IFX_PMS_MONSTAT1_ACTVCNT_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_MONSTAT1_Bits.ACTVCNT */
#define IFX_PMS_MONSTAT1_ACTVCNT_OFF (24u)

/** \brief Length for Ifx_PMS_MONSTAT2_Bits.ADCPRE */
#define IFX_PMS_MONSTAT2_ADCPRE_LEN (8u)

/** \brief Mask for Ifx_PMS_MONSTAT2_Bits.ADCPRE */
#define IFX_PMS_MONSTAT2_ADCPRE_MSK (0xffu)

/** \brief Offset for Ifx_PMS_MONSTAT2_Bits.ADCPRE */
#define IFX_PMS_MONSTAT2_ADCPRE_OFF (0u)

/** \brief Length for Ifx_PMS_MONSTAT2_Bits.ADCSB */
#define IFX_PMS_MONSTAT2_ADCSB_LEN (8u)

/** \brief Mask for Ifx_PMS_MONSTAT2_Bits.ADCSB */
#define IFX_PMS_MONSTAT2_ADCSB_MSK (0xffu)

/** \brief Offset for Ifx_PMS_MONSTAT2_Bits.ADCSB */
#define IFX_PMS_MONSTAT2_ADCSB_OFF (8u)

/** \brief Length for Ifx_PMS_MONSTAT2_Bits.ADCVDDM */
#define IFX_PMS_MONSTAT2_ADCVDDM_LEN (8u)

/** \brief Mask for Ifx_PMS_MONSTAT2_Bits.ADCVDDM */
#define IFX_PMS_MONSTAT2_ADCVDDM_MSK (0xffu)

/** \brief Offset for Ifx_PMS_MONSTAT2_Bits.ADCVDDM */
#define IFX_PMS_MONSTAT2_ADCVDDM_OFF (16u)

/** \brief Length for Ifx_PMS_MONCTRL_Bits.EVRCOVMOD */
#define IFX_PMS_MONCTRL_EVRCOVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_MONCTRL_Bits.EVRCOVMOD */
#define IFX_PMS_MONCTRL_EVRCOVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_MONCTRL_Bits.EVRCOVMOD */
#define IFX_PMS_MONCTRL_EVRCOVMOD_OFF (0u)

/** \brief Length for Ifx_PMS_MONCTRL_Bits.PREOVMOD */
#define IFX_PMS_MONCTRL_PREOVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_MONCTRL_Bits.PREOVMOD */
#define IFX_PMS_MONCTRL_PREOVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_MONCTRL_Bits.PREOVMOD */
#define IFX_PMS_MONCTRL_PREOVMOD_OFF (2u)

/** \brief Length for Ifx_PMS_MONCTRL_Bits.EVRCUVMOD */
#define IFX_PMS_MONCTRL_EVRCUVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_MONCTRL_Bits.EVRCUVMOD */
#define IFX_PMS_MONCTRL_EVRCUVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_MONCTRL_Bits.EVRCUVMOD */
#define IFX_PMS_MONCTRL_EVRCUVMOD_OFF (4u)

/** \brief Length for Ifx_PMS_MONCTRL_Bits.PREUVMOD */
#define IFX_PMS_MONCTRL_PREUVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_MONCTRL_Bits.PREUVMOD */
#define IFX_PMS_MONCTRL_PREUVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_MONCTRL_Bits.PREUVMOD */
#define IFX_PMS_MONCTRL_PREUVMOD_OFF (6u)

/** \brief Length for Ifx_PMS_MONCTRL_Bits.EVR33OVMOD */
#define IFX_PMS_MONCTRL_EVR33OVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_MONCTRL_Bits.EVR33OVMOD */
#define IFX_PMS_MONCTRL_EVR33OVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_MONCTRL_Bits.EVR33OVMOD */
#define IFX_PMS_MONCTRL_EVR33OVMOD_OFF (8u)

/** \brief Length for Ifx_PMS_MONCTRL_Bits.VDDMOVMOD */
#define IFX_PMS_MONCTRL_VDDMOVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_MONCTRL_Bits.VDDMOVMOD */
#define IFX_PMS_MONCTRL_VDDMOVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_MONCTRL_Bits.VDDMOVMOD */
#define IFX_PMS_MONCTRL_VDDMOVMOD_OFF (10u)

/** \brief Length for Ifx_PMS_MONCTRL_Bits.EVR33UVMOD */
#define IFX_PMS_MONCTRL_EVR33UVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_MONCTRL_Bits.EVR33UVMOD */
#define IFX_PMS_MONCTRL_EVR33UVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_MONCTRL_Bits.EVR33UVMOD */
#define IFX_PMS_MONCTRL_EVR33UVMOD_OFF (12u)

/** \brief Length for Ifx_PMS_MONCTRL_Bits.VDDMUVMOD */
#define IFX_PMS_MONCTRL_VDDMUVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_MONCTRL_Bits.VDDMUVMOD */
#define IFX_PMS_MONCTRL_VDDMUVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_MONCTRL_Bits.VDDMUVMOD */
#define IFX_PMS_MONCTRL_VDDMUVMOD_OFF (14u)

/** \brief Length for Ifx_PMS_MONCTRL_Bits.SWDOVMOD */
#define IFX_PMS_MONCTRL_SWDOVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_MONCTRL_Bits.SWDOVMOD */
#define IFX_PMS_MONCTRL_SWDOVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_MONCTRL_Bits.SWDOVMOD */
#define IFX_PMS_MONCTRL_SWDOVMOD_OFF (16u)

/** \brief Length for Ifx_PMS_MONCTRL_Bits.SBOVMOD */
#define IFX_PMS_MONCTRL_SBOVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_MONCTRL_Bits.SBOVMOD */
#define IFX_PMS_MONCTRL_SBOVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_MONCTRL_Bits.SBOVMOD */
#define IFX_PMS_MONCTRL_SBOVMOD_OFF (18u)

/** \brief Length for Ifx_PMS_MONCTRL_Bits.SWDUVMOD */
#define IFX_PMS_MONCTRL_SWDUVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_MONCTRL_Bits.SWDUVMOD */
#define IFX_PMS_MONCTRL_SWDUVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_MONCTRL_Bits.SWDUVMOD */
#define IFX_PMS_MONCTRL_SWDUVMOD_OFF (20u)

/** \brief Length for Ifx_PMS_MONCTRL_Bits.SBUVMOD */
#define IFX_PMS_MONCTRL_SBUVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_MONCTRL_Bits.SBUVMOD */
#define IFX_PMS_MONCTRL_SBUVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_MONCTRL_Bits.SBUVMOD */
#define IFX_PMS_MONCTRL_SBUVMOD_OFF (22u)

/** \brief Length for Ifx_PMS_MONCTRL_Bits.SLCK */
#define IFX_PMS_MONCTRL_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_MONCTRL_Bits.SLCK */
#define IFX_PMS_MONCTRL_SLCK_MSK (0x1u)

