HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.VEXTSTBYEN */
#define IFX_PMS_PMSWCR0_VEXTSTBYEN_OFF (2u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.VDDSTBYEN */
#define IFX_PMS_PMSWCR0_VDDSTBYEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.VDDSTBYEN */
#define IFX_PMS_PMSWCR0_VDDSTBYEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.VDDSTBYEN */
#define IFX_PMS_PMSWCR0_VDDSTBYEN_OFF (3u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.ESR0DFEN */
#define IFX_PMS_PMSWCR0_ESR0DFEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.ESR0DFEN */
#define IFX_PMS_PMSWCR0_ESR0DFEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.ESR0DFEN */
#define IFX_PMS_PMSWCR0_ESR0DFEN_OFF (4u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.ESR0EDCON */
#define IFX_PMS_PMSWCR0_ESR0EDCON_LEN (2u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.ESR0EDCON */
#define IFX_PMS_PMSWCR0_ESR0EDCON_MSK (0x3u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.ESR0EDCON */
#define IFX_PMS_PMSWCR0_ESR0EDCON_OFF (5u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.ESR1DFEN */
#define IFX_PMS_PMSWCR0_ESR1DFEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.ESR1DFEN */
#define IFX_PMS_PMSWCR0_ESR1DFEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.ESR1DFEN */
#define IFX_PMS_PMSWCR0_ESR1DFEN_OFF (7u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.ESR1EDCON */
#define IFX_PMS_PMSWCR0_ESR1EDCON_LEN (2u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.ESR1EDCON */
#define IFX_PMS_PMSWCR0_ESR1EDCON_MSK (0x3u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.ESR1EDCON */
#define IFX_PMS_PMSWCR0_ESR1EDCON_OFF (8u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.PINADFEN */
#define IFX_PMS_PMSWCR0_PINADFEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.PINADFEN */
#define IFX_PMS_PMSWCR0_PINADFEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.PINADFEN */
#define IFX_PMS_PMSWCR0_PINADFEN_OFF (10u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.PINAEDCON */
#define IFX_PMS_PMSWCR0_PINAEDCON_LEN (2u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.PINAEDCON */
#define IFX_PMS_PMSWCR0_PINAEDCON_MSK (0x3u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.PINAEDCON */
#define IFX_PMS_PMSWCR0_PINAEDCON_OFF (11u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.PINBDFEN */
#define IFX_PMS_PMSWCR0_PINBDFEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.PINBDFEN */
#define IFX_PMS_PMSWCR0_PINBDFEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.PINBDFEN */
#define IFX_PMS_PMSWCR0_PINBDFEN_OFF (13u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.PINBEDCON */
#define IFX_PMS_PMSWCR0_PINBEDCON_LEN (2u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.PINBEDCON */
#define IFX_PMS_PMSWCR0_PINBEDCON_MSK (0x3u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.PINBEDCON */
#define IFX_PMS_PMSWCR0_PINBEDCON_OFF (14u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_PMS_PMSWCR0_STBYRAMSEL_LEN (3u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_PMS_PMSWCR0_STBYRAMSEL_MSK (0x7u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_PMS_PMSWCR0_STBYRAMSEL_OFF (16u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.BLNKFIL */
#define IFX_PMS_PMSWCR0_BLNKFIL_LEN (4u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.BLNKFIL */
#define IFX_PMS_PMSWCR0_BLNKFIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.BLNKFIL */
#define IFX_PMS_PMSWCR0_BLNKFIL_OFF (20u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.ESR0WKEN */
#define IFX_PMS_PMSWCR0_ESR0WKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.ESR0WKEN */
#define IFX_PMS_PMSWCR0_ESR0WKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.ESR0WKEN */
#define IFX_PMS_PMSWCR0_ESR0WKEN_OFF (24u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.ESR1WKEN */
#define IFX_PMS_PMSWCR0_ESR1WKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.ESR1WKEN */
#define IFX_PMS_PMSWCR0_ESR1WKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.ESR1WKEN */
#define IFX_PMS_PMSWCR0_ESR1WKEN_OFF (25u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.PINAWKEN */
#define IFX_PMS_PMSWCR0_PINAWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.PINAWKEN */
#define IFX_PMS_PMSWCR0_PINAWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.PINAWKEN */
#define IFX_PMS_PMSWCR0_PINAWKEN_OFF (26u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.PINBWKEN */
#define IFX_PMS_PMSWCR0_PINBWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.PINBWKEN */
#define IFX_PMS_PMSWCR0_PINBWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.PINBWKEN */
#define IFX_PMS_PMSWCR0_PINBWKEN_OFF (27u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.PWRWKEN */
#define IFX_PMS_PMSWCR0_PWRWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.PWRWKEN */
#define IFX_PMS_PMSWCR0_PWRWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.PWRWKEN */
#define IFX_PMS_PMSWCR0_PWRWKEN_OFF (28u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.SCRWKEN */
#define IFX_PMS_PMSWCR0_SCRWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.SCRWKEN */
#define IFX_PMS_PMSWCR0_SCRWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.SCRWKEN */
#define IFX_PMS_PMSWCR0_SCRWKEN_OFF (29u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.PORSTWKEN */
#define IFX_PMS_PMSWCR0_PORSTWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.PORSTWKEN */
#define IFX_PMS_PMSWCR0_PORSTWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.PORSTWKEN */
#define IFX_PMS_PMSWCR0_PORSTWKEN_OFF (30u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.WUTWKEN */
#define IFX_PMS_PMSWCR0_WUTWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.WUTWKEN */
#define IFX_PMS_PMSWCR0_WUTWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.WUTWKEN */
#define IFX_PMS_PMSWCR0_WUTWKEN_OFF (31u)

/** \brief Length for Ifx_PMS_PMSWCR2_Bits.SCRINT */
#define IFX_PMS_PMSWCR2_SCRINT_LEN (8u)

/** \brief Mask for Ifx_PMS_PMSWCR2_Bits.SCRINT */
#define IFX_PMS_PMSWCR2_SCRINT_MSK (0xffu)

/** \brief Offset for Ifx_PMS_PMSWCR2_Bits.SCRINT */
#define IFX_PMS_PMSWCR2_SCRINT_OFF (0u)

