HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPms_bf.h
/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.ESR1INTCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1INTCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.ESR1INTCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1INTCLR_OFF (29u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PINAINTCLR */
#define IFX_PMS_PMSWSTATCLR_PINAINTCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PINAINTCLR */
#define IFX_PMS_PMSWSTATCLR_PINAINTCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PINAINTCLR */
#define IFX_PMS_PMSWSTATCLR_PINAINTCLR_OFF (30u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PINBINTCLR */
#define IFX_PMS_PMSWSTATCLR_PINBINTCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PINBINTCLR */
#define IFX_PMS_PMSWSTATCLR_PINBINTCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PINBINTCLR */
#define IFX_PMS_PMSWSTATCLR_PINBINTCLR_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDSTAT0_Bits.ADCFBCV */
#define IFX_PMS_EVRSDSTAT0_ADCFBCV_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDSTAT0_Bits.ADCFBCV */
#define IFX_PMS_EVRSDSTAT0_ADCFBCV_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDSTAT0_Bits.ADCFBCV */
#define IFX_PMS_EVRSDSTAT0_ADCFBCV_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDSTAT0_Bits.DPWMOUT */
#define IFX_PMS_EVRSDSTAT0_DPWMOUT_LEN (12u)

/** \brief Mask for Ifx_PMS_EVRSDSTAT0_Bits.DPWMOUT */
#define IFX_PMS_EVRSDSTAT0_DPWMOUT_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_EVRSDSTAT0_Bits.DPWMOUT */
#define IFX_PMS_EVRSDSTAT0_DPWMOUT_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL0_Bits.SDFREQSPRD */
#define IFX_PMS_EVRSDCTRL0_SDFREQSPRD_LEN (16u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL0_Bits.SDFREQSPRD */
#define IFX_PMS_EVRSDCTRL0_SDFREQSPRD_MSK (0xffffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL0_Bits.SDFREQSPRD */
#define IFX_PMS_EVRSDCTRL0_SDFREQSPRD_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL0_Bits.SDFREQ */
#define IFX_PMS_EVRSDCTRL0_SDFREQ_LEN (12u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL0_Bits.SDFREQ */
#define IFX_PMS_EVRSDCTRL0_SDFREQ_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL0_Bits.SDFREQ */
#define IFX_PMS_EVRSDCTRL0_SDFREQ_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL0_Bits.NGOFF */
#define IFX_PMS_EVRSDCTRL0_NGOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL0_Bits.NGOFF */
#define IFX_PMS_EVRSDCTRL0_NGOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL0_Bits.NGOFF */
#define IFX_PMS_EVRSDCTRL0_NGOFF_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCTRL0_Bits.PGOFF */
#define IFX_PMS_EVRSDCTRL0_PGOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL0_Bits.PGOFF */
#define IFX_PMS_EVRSDCTRL0_PGOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL0_Bits.PGOFF */
#define IFX_PMS_EVRSDCTRL0_PGOFF_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCTRL0_Bits.UP */
#define IFX_PMS_EVRSDCTRL0_UP_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL0_Bits.UP */
#define IFX_PMS_EVRSDCTRL0_UP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL0_Bits.UP */
#define IFX_PMS_EVRSDCTRL0_UP_OFF (30u)

/** \brief Length for Ifx_PMS_EVRSDCTRL0_Bits.LCK */
#define IFX_PMS_EVRSDCTRL0_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL0_Bits.LCK */
#define IFX_PMS_EVRSDCTRL0_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL0_Bits.LCK */
#define IFX_PMS_EVRSDCTRL0_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL1_Bits.M0TOFF */
#define IFX_PMS_EVRSDCTRL1_M0TOFF_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL1_Bits.M0TOFF */
#define IFX_PMS_EVRSDCTRL1_M0TOFF_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL1_Bits.M0TOFF */
#define IFX_PMS_EVRSDCTRL1_M0TOFF_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL1_Bits.M0TON */
#define IFX_PMS_EVRSDCTRL1_M0TON_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL1_Bits.M0TON */
#define IFX_PMS_EVRSDCTRL1_M0TON_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL1_Bits.M0TON */
#define IFX_PMS_EVRSDCTRL1_M0TON_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL1_Bits.M0S0COEFF */
#define IFX_PMS_EVRSDCTRL1_M0S0COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL1_Bits.M0S0COEFF */
#define IFX_PMS_EVRSDCTRL1_M0S0COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL1_Bits.M0S0COEFF */
#define IFX_PMS_EVRSDCTRL1_M0S0COEFF_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL1_Bits.M0DEADBD */
#define IFX_PMS_EVRSDCTRL1_M0DEADBD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL1_Bits.M0DEADBD */
#define IFX_PMS_EVRSDCTRL1_M0DEADBD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL1_Bits.M0DEADBD */
#define IFX_PMS_EVRSDCTRL1_M0DEADBD_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCTRL1_Bits.M0ADCZB */
#define IFX_PMS_EVRSDCTRL1_M0ADCZB_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL1_Bits.M0ADCZB */
#define IFX_PMS_EVRSDCTRL1_M0ADCZB_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL1_Bits.M0ADCZB */
#define IFX_PMS_EVRSDCTRL1_M0ADCZB_OFF (22u)

/** \brief Length for Ifx_PMS_EVRSDCTRL1_Bits.M0SKIP */
#define IFX_PMS_EVRSDCTRL1_M0SKIP_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL1_Bits.M0SKIP */
#define IFX_PMS_EVRSDCTRL1_M0SKIP_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL1_Bits.M0SKIP */
#define IFX_PMS_EVRSDCTRL1_M0SKIP_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL1_Bits.SYNCEN */
#define IFX_PMS_EVRSDCTRL1_SYNCEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL1_Bits.SYNCEN */
#define IFX_PMS_EVRSDCTRL1_SYNCEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL1_Bits.SYNCEN */
#define IFX_PMS_EVRSDCTRL1_SYNCEN_OFF (30u)

/** \brief Length for Ifx_PMS_EVRSDCTRL1_Bits.LCK */
#define IFX_PMS_EVRSDCTRL1_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL1_Bits.LCK */
#define IFX_PMS_EVRSDCTRL1_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL1_Bits.LCK */
#define IFX_PMS_EVRSDCTRL1_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL2_Bits.LPBNDOFFSET */
#define IFX_PMS_EVRSDCTRL2_LPBNDOFFSET_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL2_Bits.LPBNDOFFSET */
#define IFX_PMS_EVRSDCTRL2_LPBNDOFFSET_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL2_Bits.LPBNDOFFSET */
#define IFX_PMS_EVRSDCTRL2_LPBNDOFFSET_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL2_Bits.LPBNDWIDTH */
#define IFX_PMS_EVRSDCTRL2_LPBNDWIDTH_LEN (4u)

