HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG2 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG2_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF6_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF6_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF6_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF6_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF6_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF6_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF7_Bits.CT5REG3 */
#define IFX_PMS_EVRSDCOEFF7_CT5REG3_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF7_Bits.CT5REG3 */
#define IFX_PMS_EVRSDCOEFF7_CT5REG3_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF7_Bits.CT5REG3 */
#define IFX_PMS_EVRSDCOEFF7_CT5REG3_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF7_Bits.CT5REG4 */
#define IFX_PMS_EVRSDCOEFF7_CT5REG4_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF7_Bits.CT5REG4 */
#define IFX_PMS_EVRSDCOEFF7_CT5REG4_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF7_Bits.CT5REG4 */
#define IFX_PMS_EVRSDCOEFF7_CT5REG4_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF7_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF7_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF7_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF7_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF7_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF7_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG0 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG0_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG0 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG0_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG0 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG0_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG1 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG1_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG1 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG1_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG1 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG1_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG2 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG2_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG2 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG2_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG2 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG2_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF8_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF8_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF8_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF8_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF8_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF8_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF9_Bits.CT33REG3 */
#define IFX_PMS_EVRSDCOEFF9_CT33REG3_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF9_Bits.CT33REG3 */
#define IFX_PMS_EVRSDCOEFF9_CT33REG3_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF9_Bits.CT33REG3 */
#define IFX_PMS_EVRSDCOEFF9_CT33REG3_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF9_Bits.CT33REG4 */
#define IFX_PMS_EVRSDCOEFF9_CT33REG4_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF9_Bits.CT33REG4 */
#define IFX_PMS_EVRSDCOEFF9_CT33REG4_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF9_Bits.CT33REG4 */
#define IFX_PMS_EVRSDCOEFF9_CT33REG4_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF9_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF9_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF9_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF9_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF9_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF9_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF4 */
#define IFX_PMS_AG_STDBY0_SF4_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF4 */
#define IFX_PMS_AG_STDBY0_SF4_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF4 */
#define IFX_PMS_AG_STDBY0_SF4_OFF (4u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF5 */
#define IFX_PMS_AG_STDBY0_SF5_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF5 */
#define IFX_PMS_AG_STDBY0_SF5_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF5 */
#define IFX_PMS_AG_STDBY0_SF5_OFF (5u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF6 */
#define IFX_PMS_AG_STDBY0_SF6_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF6 */
#define IFX_PMS_AG_STDBY0_SF6_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF6 */
#define IFX_PMS_AG_STDBY0_SF6_OFF (6u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF7 */
#define IFX_PMS_AG_STDBY0_SF7_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF7 */
#define IFX_PMS_AG_STDBY0_SF7_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF7 */
#define IFX_PMS_AG_STDBY0_SF7_OFF (7u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF8 */
#define IFX_PMS_AG_STDBY0_SF8_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF8 */
#define IFX_PMS_AG_STDBY0_SF8_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF8 */
#define IFX_PMS_AG_STDBY0_SF8_OFF (8u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF9 */
#define IFX_PMS_AG_STDBY0_SF9_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF9 */
#define IFX_PMS_AG_STDBY0_SF9_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF9 */
#define IFX_PMS_AG_STDBY0_SF9_OFF (9u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF10 */
#define IFX_PMS_AG_STDBY0_SF10_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF10 */
#define IFX_PMS_AG_STDBY0_SF10_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF10 */
#define IFX_PMS_AG_STDBY0_SF10_OFF (10u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF11 */
#define IFX_PMS_AG_STDBY0_SF11_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF11 */
#define IFX_PMS_AG_STDBY0_SF11_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF11 */
#define IFX_PMS_AG_STDBY0_SF11_OFF (11u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF12 */
#define IFX_PMS_AG_STDBY0_SF12_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF12 */
#define IFX_PMS_AG_STDBY0_SF12_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF12 */
#define IFX_PMS_AG_STDBY0_SF12_OFF (12u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF13 */
#define IFX_PMS_AG_STDBY0_SF13_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF13 */
#define IFX_PMS_AG_STDBY0_SF13_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF13 */
#define IFX_PMS_AG_STDBY0_SF13_OFF (13u)

