HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPms_bf.h
/** \brief Length for Ifx_PMS_DTSLIM_Bits.UOF */
#define IFX_PMS_DTSLIM_UOF_LEN (1u)

/** \brief Mask for Ifx_PMS_DTSLIM_Bits.UOF */
#define IFX_PMS_DTSLIM_UOF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_DTSLIM_Bits.UOF */
#define IFX_PMS_DTSLIM_UOF_OFF (31u)

/** \brief Length for Ifx_PMS_OTSS_Bits.OTGB0 */
#define IFX_PMS_OTSS_OTGB0_LEN (4u)

/** \brief Mask for Ifx_PMS_OTSS_Bits.OTGB0 */
#define IFX_PMS_OTSS_OTGB0_MSK (0xfu)

/** \brief Offset for Ifx_PMS_OTSS_Bits.OTGB0 */
#define IFX_PMS_OTSS_OTGB0_OFF (0u)

/** \brief Length for Ifx_PMS_OTSS_Bits.OTGB1 */
#define IFX_PMS_OTSS_OTGB1_LEN (4u)

/** \brief Mask for Ifx_PMS_OTSS_Bits.OTGB1 */
#define IFX_PMS_OTSS_OTGB1_MSK (0xfu)

/** \brief Offset for Ifx_PMS_OTSS_Bits.OTGB1 */
#define IFX_PMS_OTSS_OTGB1_OFF (8u)

/** \brief Length for Ifx_PMS_OTSC0_Bits.B0LAM */
#define IFX_PMS_OTSC0_B0LAM_LEN (4u)

/** \brief Mask for Ifx_PMS_OTSC0_Bits.B0LAM */
#define IFX_PMS_OTSC0_B0LAM_MSK (0xfu)

/** \brief Offset for Ifx_PMS_OTSC0_Bits.B0LAM */
#define IFX_PMS_OTSC0_B0LAM_OFF (0u)

/** \brief Length for Ifx_PMS_OTSC0_Bits.B0HAM */
#define IFX_PMS_OTSC0_B0HAM_LEN (4u)

/** \brief Mask for Ifx_PMS_OTSC0_Bits.B0HAM */
#define IFX_PMS_OTSC0_B0HAM_MSK (0xfu)

/** \brief Offset for Ifx_PMS_OTSC0_Bits.B0HAM */
#define IFX_PMS_OTSC0_B0HAM_OFF (8u)

/** \brief Length for Ifx_PMS_OTSC0_Bits.B1LAM */
#define IFX_PMS_OTSC0_B1LAM_LEN (4u)

/** \brief Mask for Ifx_PMS_OTSC0_Bits.B1LAM */
#define IFX_PMS_OTSC0_B1LAM_MSK (0xfu)

/** \brief Offset for Ifx_PMS_OTSC0_Bits.B1LAM */
#define IFX_PMS_OTSC0_B1LAM_OFF (16u)

/** \brief Length for Ifx_PMS_OTSC0_Bits.B1HAM */
#define IFX_PMS_OTSC0_B1HAM_LEN (4u)

/** \brief Mask for Ifx_PMS_OTSC0_Bits.B1HAM */
#define IFX_PMS_OTSC0_B1HAM_MSK (0xfu)

/** \brief Offset for Ifx_PMS_OTSC0_Bits.B1HAM */
#define IFX_PMS_OTSC0_B1HAM_OFF (24u)

/** \brief Length for Ifx_PMS_OTSC1_Bits.B0EC */
#define IFX_PMS_OTSC1_B0EC_LEN (4u)

/** \brief Mask for Ifx_PMS_OTSC1_Bits.B0EC */
#define IFX_PMS_OTSC1_B0EC_MSK (0xfu)

/** \brief Offset for Ifx_PMS_OTSC1_Bits.B0EC */
#define IFX_PMS_OTSC1_B0EC_OFF (0u)

/** \brief Length for Ifx_PMS_OTSC1_Bits.B1EC */
#define IFX_PMS_OTSC1_B1EC_LEN (4u)

/** \brief Mask for Ifx_PMS_OTSC1_Bits.B1EC */
#define IFX_PMS_OTSC1_B1EC_MSK (0xfu)

/** \brief Offset for Ifx_PMS_OTSC1_Bits.B1EC */
#define IFX_PMS_OTSC1_B1EC_OFF (8u)

/** \brief Length for Ifx_PMS_OTSC1_Bits.DMONAD */
#define IFX_PMS_OTSC1_DMONAD_LEN (8u)

/** \brief Mask for Ifx_PMS_OTSC1_Bits.DMONAD */
#define IFX_PMS_OTSC1_DMONAD_MSK (0xffu)

/** \brief Offset for Ifx_PMS_OTSC1_Bits.DMONAD */
#define IFX_PMS_OTSC1_DMONAD_OFF (16u)

/** \brief Length for Ifx_PMS_OTSC1_Bits.SMCDBG */
#define IFX_PMS_OTSC1_SMCDBG_LEN (8u)

/** \brief Mask for Ifx_PMS_OTSC1_Bits.SMCDBG */
#define IFX_PMS_OTSC1_SMCDBG_MSK (0xffu)

/** \brief Offset for Ifx_PMS_OTSC1_Bits.SMCDBG */
#define IFX_PMS_OTSC1_SMCDBG_OFF (24u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN0 */
#define IFX_PMS_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN0 */
#define IFX_PMS_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN0 */
#define IFX_PMS_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN1 */
#define IFX_PMS_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN1 */
#define IFX_PMS_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN1 */
#define IFX_PMS_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN2 */
#define IFX_PMS_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN2 */
#define IFX_PMS_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN2 */
#define IFX_PMS_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN3 */
#define IFX_PMS_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN3 */
#define IFX_PMS_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN3 */
#define IFX_PMS_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN4 */
#define IFX_PMS_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN4 */
#define IFX_PMS_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN4 */
#define IFX_PMS_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN5 */
#define IFX_PMS_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN5 */
#define IFX_PMS_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN5 */
#define IFX_PMS_ACCEN0_EN5_OFF (5u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN6 */
#define IFX_PMS_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN6 */
#define IFX_PMS_ACCEN0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN6 */
#define IFX_PMS_ACCEN0_EN6_OFF (6u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN7 */
#define IFX_PMS_ACCEN0_EN7_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN7 */
#define IFX_PMS_ACCEN0_EN7_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN7 */
#define IFX_PMS_ACCEN0_EN7_OFF (7u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN8 */
#define IFX_PMS_ACCEN0_EN8_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN8 */
#define IFX_PMS_ACCEN0_EN8_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN8 */
#define IFX_PMS_ACCEN0_EN8_OFF (8u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN9 */
#define IFX_PMS_ACCEN0_EN9_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN9 */
#define IFX_PMS_ACCEN0_EN9_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN9 */
#define IFX_PMS_ACCEN0_EN9_OFF (9u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN10 */
#define IFX_PMS_ACCEN0_EN10_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN10 */
#define IFX_PMS_ACCEN0_EN10_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN10 */
#define IFX_PMS_ACCEN0_EN10_OFF (10u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN11 */
#define IFX_PMS_ACCEN0_EN11_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN11 */
#define IFX_PMS_ACCEN0_EN11_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN11 */
#define IFX_PMS_ACCEN0_EN11_OFF (11u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN12 */
#define IFX_PMS_ACCEN0_EN12_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN12 */
#define IFX_PMS_ACCEN0_EN12_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN12 */
#define IFX_PMS_ACCEN0_EN12_OFF (12u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN13 */
#define IFX_PMS_ACCEN0_EN13_LEN (1u)

